# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyInt64..::..Value Property
AssetPropertyInt64 Class See Also
---
Get the value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public long Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As Long
	Get
```

Visual C++
---
```text
public:
property long long Value {
	long long get ();
}
```

# See Also
AssetPropertyInt64 Class
Autodesk.Revit.DB.Visual Namespace